# GetRibbonPanels Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UIApplication..::..GetRibbonPanels Method
UIApplication Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetRibbonPanels()()()() | Get all the custom Panels on Add-Ins tab of Revit. |
| GetRibbonPanels(String) | Get all the custom Panels on a designated Revit tab. |
| GetRibbonPanels(Tab) | Get all the custom Panels on a designated standard Revit tab. |

# See Also
UIApplication Class
UIApplication Members
Autodesk.Revit.UI Namespace